БухЭксп/Catalogs/CW_ПодключаемыеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПодключаемыеОбъекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Встроенная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСубъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтладкаИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасполагатьНаРабочемСтоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ТипыПодключаемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВстроеннойОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПредставленияПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяВерсияМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МетодыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомандыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяКоманда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступностьОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаПользователей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасположениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_РазделыРабочегоСтола</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВнешнейКоманды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетаданныеКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормыОбъкта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппыДоступаКоманды</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасположениеГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередЭлементом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Макросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/CW_ТипыПодключаемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ТипыПодключаемыхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОтчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПодключаемыеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПодключаемыеФормы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодключаемыйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПодключаемыеОбъекты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользованиеВнешнихПодключаемыхФормОбъектов 	= ПолучитьФункциональнуюОпцию("CW_ИспользованиеВнешнихПодключаемыхФормОбъектов");
	ИспользованиеВнешнихПодписок 					= ПолучитьФункциональнуюОпцию("CW_ИспользованиеВнешнихПодписок");
	
	ЭтаФорма.ТолькоПросмотр = (НЕ CW_ПраваДоступа.ПравоДоступно("УправлениеСистемнымиФункциями"));
	Если НЕ Объект.Ссылка.Пустая() И НЕ Объект.Встроенная Тогда
		ОбработкаЗагружена = Истина;
	КонецЕсли; 
	
	ВерсияПодсистемыОбъекта = ?(Объект.ВерсияПодсистемы = "", 			"0.0.0.0", Объект.ВерсияПодсистемы);
	МинимальнаяВерсияМодуля = ?(Объект.МинимальнаяВерсияМодуля = "", 	"0.0.0.0", Объект.МинимальнаяВерсияМодуля);
	
	ТекущаяВерсияМодуля = CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы();
	
	ТекущаяВерсияПодсистемы = "";
	ВерсииПодсистемБЭ 		= _БЭ.ВерсииПодсистемБЭ();
	ВерсииПодсистемБЭ.Свойство("ВнешниеПодключаемыеОбъекты", ТекущаяВерсияПодсистемы);
	ТекущаяВерсияПодсистемы = ?(ЗначениеЗаполнено(ТекущаяВерсияПодсистемы), ТекущаяВерсияПодсистемы , "0.0.0.0");

	ОбновитьАдресаГруппДоступа();
	
	Если Объект.Встроенная Тогда
		ПроверитьВстроеннуюОбработку();
	КонецЕсли;
	
	_УправлениеФормой();
	
	УстановитьПредупреждеиеНесоответствииВерсии();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредупреждеиеНесоответствииВерсии()
	
	Если Не ПроверитьМинимальнуюВерсию(МинимальнаяВерсияМодуля) Тогда 
		Элементы.ДекорацияСовместимость.Видимость = истина;
		Элементы.ДекорацияСовместимость.Заголовок = "Внешняя подключаемая обработка не соответствует минимальной весрии модуля: "+СокрЛП(МинимальнаяВерсияМодуля);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПроверитьМинимальнуюВерсию(МинимальнаяВерсия)
	
	Если Не ЗначениеЗаполнено(МинимальнаяВерсия) или МинимальнаяВерсия = "0.0.0.0" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат СравнитьВерсии(ТекущаяВерсияМодуля, МинимальнаяВерсия);

КонецФункции  

 &НаСервере
Функция СравнитьВерсии(ТекущаяВерсия, МинимальнаяВерсия) Экспорт  
	
	Если СокрЛП(ТекущаяВерсия) = СокрЛП(МинимальнаяВерсия) Тогда
		Возврат Истина;
	КонецЕсли;
	
	мТекущаяВерсия 		= СтрРазделить(СокрЛП(ТекущаяВерсия),		".");
	мМинимальнаяВерсия	= СтрРазделить(СокрЛП(МинимальнаяВерсия),	".");
	
	Для Индекс = 0 по мТекущаяВерсия.ВГраница() Цикл
		
		индТекущаяВерсия 		= Число(мТекущаяВерсия.Получить(Индекс));
		индМинимальнаяВерсия 	= Число(мМинимальнаяВерсия.Получить(Индекс));
		
		Если индТекущаяВерсия > индМинимальнаяВерсия Тогда
			//Разряд текущей версии больше минимальной версии
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции // СравнитьВерсии()

&НаСервере
Процедура _УправлениеФормой()
	
	ЭтоВнешнийОтчет 	= Объект.ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет");
	ЭтоВнешняяОбработка = Объект.ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка");
	
	ПоказатьНастройкиПодписки 			= ЭтоВнешняяОбработка 	и Объект.Вид = "ВнешняяПодписка";
	ПоказатьНастройкиКоманды 			= (ЭтоВнешняяОбработка или ЭтоВнешнийОтчет)  и Объект.Вид = "ВнешняяКоманда";
	ПоказатьНастройкиПодключаемойФормы  = ЭтоВнешняяОбработка  и Объект.Вид = "ВнешняяФорма";
	
	Элементы.Отладка.Видимость 									= Не Объект.Встроенная;
	Элементы.Сохранить.Видимость 								= Не Объект.Встроенная;
	Элементы.ГруппаДанныеФайла.Видимость						= Не Объект.Встроенная;
	
	Элементы.ПеречитатьИнформациюОВнешнейОбработке.Видимость	= Объект.Встроенная;
	Элементы.ПредставлениеОбработки.Видимость 					= Объект.Встроенная;
	
	Элементы.ОтладкаИмяОбработки.Видимость 		= Объект.Отладка;
	Элементы.ИмяВстроеннойОбработки.Видимость 	= Объект.Встроенная;
	
	Элементы.Настройка.Видимость 				= Объект.Настройка;
	Элементы.НастройкиВнешнегоОтчета.Видимость  = Объект.РасполагатьНаРабочемСтоле;
	Элементы.НастройкиВнешнейПодписки.Видимость = ПоказатьнастройкиПодписки и ИспользованиеВнешнихПодписок;
	Элементы.НадписьВнешниеПодписки.Видимость   = ПоказатьнастройкиПодписки и НЕ ИспользованиеВнешнихПодписок;
	Элементы.НастройкаВнешнейКоманды.Видимость  = ПоказатьНастройкиКоманды;
	
	Элементы.НастройкиПодключаемойФормы.Видимость  	= ПоказатьНастройкиПодключаемойФормы и ИспользованиеВнешнихПодключаемыхФормОбъектов;
	Элементы.НадписьВнешниеФормы.Видимость 	 		= ПоказатьНастройкиПодключаемойФормы и Не ИспользованиеВнешнихПодключаемыхФормОбъектов;
	
	Элементы.НадписьНетНастроек.Видимость  = 	Не Объект.Настройка 				и 
												Не Объект.РасполагатьНаРабочемСтоле и 
												Не ПоказатьНастройкиПодписки 		и 
												Не ПоказатьНастройкиКоманды  		и
												НЕ ПоказатьНастройкиПодключаемойФормы;
												
	Элементы.ГруппаШаблонПредставления.Видимость = Объект.Вид = "ПечатнаяФорма";
	
	Элементы.ИсторияИзменений.Видимость			 = Объект.ИсторияИзменений;
	
КонецПроцедуры


&НаКлиенте
Процедура ВстроеннаяПриИзменении(Элемент)
	
	ОбработкаЗагружена = Ложь;
	
	Если Объект.Встроенная Тогда
		Объект.Отладка 		= Ложь;
		ОбработкаЗагружена 	= Истина;
		
	КонецЕсли;
	
	_УправлениеФормой();

КонецПроцедуры

// ---------------------------------------------------------------------------- 
&НаКлиенте
Процедура ЗагрузитьВнешнийФайл(Команда)
	
	СоответствиеФильтра = ПолучитьСоответствиеФильтровТипуОбъекта();
	
	Фильтр = СоответствиеФильтра.Получить(Объект.ТипВнешнегоОбъекта);
	Если Фильтр = Неопределено Тогда
		Фильтр = "Внешние обработки (*.epf)|*.epf|Внешние отчеты (*.erf)|*.erf";
	КонецЕсли;
	
	ДиалогОткрытияФайла 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла 		= "";
	ДиалогОткрытияФайла.Фильтр 				= Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор 	= Ложь;
	ДиалогОткрытияФайла.Заголовок 			= "Выберите внешний файл";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьЗагрузкуФайла",ЭтотОбъект); 
	
	НачатьПомещениеФайла(ОписаниеОповещения, , ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСоответствиеФильтровТипуОбъекта()
	
	Результат = Новый Соответствие;
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет"), 		"Внешние отчеты (*.erf)|*.erf"); 
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка"), 	"Внешние обработки (*.epf)|*.epf"); 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьЗагрузкуФайла(Результат, Адрес, ПолноеИмя, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;

	Файл = Новый Файл(ПолноеИмя);

	СтруктураОтвета = ПолучитьСтруктуруОписанияДляЗагруженнойОбработкиНаСервере(Файл.Имя, Файл.Расширение, Адрес);
	Если СтруктураОтвета.Код <> 0 Тогда
		ПоказатьПредупреждение(,СтруктураОтвета.ОписаниеОшибки,,"Ошибка загрузки внешней обработки");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметровВОпроса = Новый Структура;
	СтруктураПараметровВОпроса.Вставить("СтруктураОтвета", 	СтруктураОтвета);
	СтруктураПараметровВОпроса.Вставить("Файл", 			Файл);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьЗагрузкуФайлаПродолжение", ЭтотОбъект, СтруктураПараметровВОпроса);

	Если Объект.ИмяФайла <> Файл.Имя и ОбработкаЗагружена Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		
		СтрокаШабона = "Имя загружаемго файла ""%1"" отличается от загруженного ранее ""%2"". Продолжить?";
		ТекстВопроса = СтрШаблон(СтрокаШабона, Файл.Имя, Объект.ИмяФайла); 
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
		
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение,  КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗагрузкуФайлаПродолжение(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	Файл = ДополнительныеПараметры.Файл;

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПолученияВремениИзмененияФайла",ЭтотОбъект);
	Файл.НачатьПолучениеВремениИзменения(ОписаниеОповещения);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПолученияРазмераФайла",ЭтотОбъект);
	Файл.НачатьПолучениеРазмера(ОписаниеОповещения);
	
	ОбработатьЗагрузкуОбъекта(ДополнительныеПараметры.СтруктураОтвета, Файл.Имя);
	
	ПоказатьОповещениеПользователя("Загрузка внешнего файла",, Файл.Имя,,,УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияРазмераФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.РазмерФайла = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияВремениИзмененияФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.ДатаИзмененияФайла = Результат;
	КонецЕсли;
	
КонецПроцедуры
	
// ---------------------------------------------------------------------------- 

&НаСервере
Функция ПолучитьСтруктуруОписанияДляЗагруженнойОбработкиНаСервере(ИмяФайла, Расширение, АдресФайла)
	
	СтруктураОтвета = Новый Структура("Код,СтруктураОписания,ОписаниеОшибки");

	Попытка
		
		ДвоичныеДанные 		= ПолучитьИзВременногоХранилища(АдресФайла);
		ИмяФайлаОбработки 	= КаталогВременныхФайлов()+ ИмяФайла;
		
		ДвоичныеДанные.Записать(ИмяФайлаОбработки);
		
		АдресОбработки = ПоместитьВоВременноеХранилище(ДвоичныеДанные,ЭтаФорма.УникальныйИдентификатор);
		
		Если Расширение = ".erf" Тогда
			ВнешняяОбработка = ВнешниеОтчеты.Создать(ИмяФайлаОбработки);
		ИначеЕсли Расширение = ".epf" Тогда
			ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайлаОбработки);
		Иначе
			СтруктураОтвета.Вставить("Код", 1);
			СтруктураОтвета.Вставить("ОписаниеОшибки","Неправильный тип файла ("+Расширение+")!");
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		СтруктураОписания 	= ВнешняяОбработка.Информация();
		ВнешняяОбработка 	= Неопределено;       
		
		Если Не ПроверитьМинимальнуюВерсию(СтруктураОписания.МинимальнаяВерсияМодуля) Тогда
			СтруктураОтвета.Вставить("Код", 1);
			СтруктураОтвета.Вставить("ОписаниеОшибки","Внешняя подключаемая обработка не соответствует минимальной весрии модуля: "+СокрЛП(СтруктураОписания.МинимальнаяВерсияМодуля));
			Возврат СтруктураОтвета;
		КонецЕсли;

		СтруктураОтвета.Вставить("Код", 0);
		СтруктураОтвета.Вставить("СтруктураОписания", ПоместитьВоВременноеХранилище(СтруктураОписания,ЭтаФорма.УникальныйИдентификатор));
		
	Исключение
			СтруктураОтвета.Вставить("Код", 1);
			СтруктураОтвета.Вставить("ОписаниеОшибки",ОписаниеОшибки());
			
	КонецПопытки; 
	
	Возврат СтруктураОтвета;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруОписанияДляВстроеннойОбработки(ПроверятьМинимальнуюВерсию = Истина)
	
	СтруктураОтвета = Новый Структура("Код,СтруктураОписания,ОписаниеОшибки");
	
	Попытка
		Если ЗначениеЗаполнено(Объект.ТипВнешнегоОбъекта) Тогда 
			Если Объект.ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет") Тогда
				ВнешняяОбработка = Отчеты[Объект.ИмяВстроеннойОбработки].Создать();
			Иначе
				ВнешняяОбработка = Обработки[Объект.ИмяВстроеннойОбработки].Создать();
			КонецЕсли;
		Иначе
			Если НЕ Неопределено = Метаданные.Отчеты.Найти(Объект.ИмяВстроеннойОбработки) Тогда 
				ВнешняяОбработка = Отчеты[Объект.ИмяВстроеннойОбработки].Создать();
			Иначе
				ВнешняяОбработка = Обработки[Объект.ИмяВстроеннойОбработки].Создать();
			КонецЕсли;
		КонецЕсли;
	Исключение    
		СтруктураОтвета.Вставить("Код", 1);
		СтруктураОтвета.Вставить("ОписаниеОшибки",ОписаниеОшибки());
	КонецПопытки; 
	
	Попытка
		СтруктураОписания 	= ВнешняяОбработка.Информация();
		ВнешняяОбработка 	= Неопределено;   
		
		Если ПроверятьМинимальнуюВерсию Тогда
			Если Не ПроверитьМинимальнуюВерсию(СтруктураОписания.МинимальнаяВерсияМодуля) Тогда
				СтруктураОтвета.Вставить("Код", 1);
				СтруктураОтвета.Вставить("ОписаниеОшибки","Внешняя подключаемая обработка не соответствует минимальной весрии модуля: "+СокрЛП(СтруктураОписания.МинимальнаяВерсияМодуля));
				Возврат СтруктураОтвета;
			КонецЕсли;                          
		КонецЕсли;
		
		СтруктураОтвета.Вставить("Код", 0);
		СтруктураОтвета.Вставить("СтруктураОписания", ПоместитьВоВременноеХранилище(СтруктураОписания,ЭтаФорма.УникальныйИдентификатор));
		
		Возврат СтруктураОтвета;
		
	Исключение
		СтруктураОтвета.Вставить("Код", 1);
		СтруктураОтвета.Вставить("ОписаниеОшибки",ОписаниеОшибки());
	КонецПопытки; 
	
	Возврат СтруктураОтвета;

КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;   
	
	ДанныеФайла = ПолучитьДанныеФайла(Объект.Ссылка);
	Если ДанныеФайла = Неопределено Тогда
		ПоказатьПредупреждение(, "Ошибка получения файла");
		Возврат;
	КонецЕсли;

	ОписаниеПередаваемогоФайла = Новый ОписаниеПередаваемогоФайла;
	ОписаниеПередаваемогоФайла.Имя 		= ДанныеФайла.ИмяФайла;
	ОписаниеПередаваемогоФайла.Хранение = ДанныеФайла.АдресФайла;
	
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(ОписаниеПередаваемогоФайла);

	ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов("Сохранить как...", Ложь);
	
	НачатьПолучениеФайловССервера(ПолучаемыеФайлы, ПараметрыДиалогаПолученияФайлов); 
	
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьДанныеФайла(ВыбранныйФайл)
	
	ДвоичныеДанные = ВыбранныйФайл.ХранилищеОбработки.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;  
	
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);

	ПолучитьДанныеФайла = Новый Структура;
	ПолучитьДанныеФайла.Вставить("ИмяФайла",	ВыбранныйФайл.ИмяФайла);
	ПолучитьДанныеФайла.Вставить("АдресФайла",	АдресФайла);
	
	Возврат ПолучитьДанныеФайла
	
КонецФункции


&НаКлиенте
Процедура ЗавершитьПолучениеФайлов(ПолученныеФайлы, ДополнительныеПараметры) Экспорт 
	
	Если ПолученныеФайлы <> Неопределено Тогда
		
		Каталог = СтрЗаменить(ПолученныеФайлы[0].ПолноеИмя, "\"+ПолученныеФайлы[0].Имя, "");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Каталог", Каталог);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОповещениеСохранения", ЭтотОбъект, СтруктураПараметров);
		
		ПоказатьОповещениеПользователя("Сохранение файла", ОписаниеОповещения, ПолученныеФайлы[0].Имя);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещениеСохранения(ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("Каталог") Тогда
		ЗапуститьПриложение(ДополнительныеПараметры.Каталог);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если АдресОбработки <> "" Тогда
		
		ТекущийОбъект.ХранилищеОбработки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресОбработки));
		
	КонецЕсли; 
	
	Если Объект.ПараметрыВнешнейКоманды.Количество() > 0 Тогда
		Для НомерСтоки = 0 По Объект.ПараметрыВнешнейКоманды.Количество()-1 Цикл
			
			СтрокаОбъектаФормы 		= Объект.ПараметрыВнешнейКоманды[НомерСтоки];
			СтрокаТекущегоОбъекта 	= ТекущийОбъект.ПараметрыВнешнейКоманды[НомерСтоки];
			
			Если СтрокаОбъектаФормы.АдресГруппДоступа <> "" Тогда
				СтрокаТекущегоОбъекта.ГруппыДоступаКоманды = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СтрокаОбъектаФормы.АдресГруппДоступа));
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&наСервере
Процедура ОбновитьАдресаГруппДоступа()
	
	Если Объект.ПараметрыВнешнейКоманды.Количество() > 0 Тогда
		Для НомерСтоки = 0 По Объект.ПараметрыВнешнейКоманды.Количество()-1 Цикл
			
			СтрокаОбъектаФормы	= Объект.ПараметрыВнешнейКоманды[НомерСтоки];
			СтрокаСсылки		= Объект.Ссылка.ПараметрыВнешнейКоманды[НомерСтоки];
			
			СтрокаОбъектаФормы.АдресГруппДоступа = ПоместитьВоВременноеХранилище(СтрокаСсылки.ГруппыДоступаКоманды.Получить(), ЭтаФорма);
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	// необходимо подключить обработку, получить её имя и далее получить форму настроек по имени
	Если Модифицированность Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаНастройка", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Необходимо записать элемент. Продолжить?", Режим, 0);
	Иначе
		ПродолжитьНастройку();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаНастройка(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

   ПродолжитьНастройку();

КонецПроцедуры

&НаКлиенте 
Процедура ПродолжитьНастройку()
	
	ИмяФормыНастроек = _ИмяФормыНастроек();
	Если ИмяФормы <> Неопределено Тогда
		
		ПФ = Новый Структура("Объект",Объект.Ссылка);
		ОткрытьФорму(ИмяФормыНастроек,ПФ,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция _ИмяФормыНастроек()
	// --- 
	
	_ПО.ПодключитьОбработку(Объект.Ссылка);
	Возврат(_ПО.ПолучитьПолноеИмяФормыПоТипу(Объект.Ссылка,"ФормаНастроек"));
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОтладкаПриИзменении(Элемент)
	
	Если Не Объект.Отладка Тогда
		Объект.ОтладкаИмяОбработки 	= "";
		Объект.ИмяВнешнегоОбъекта 	= "";
	КонецЕсли;
	
	_УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОбработкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Оповещение = Новый ОписаниеОповещения("ПродолжитьВыборВстроеннойОбработки", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_ПодключаемыеОбъекты.Форма.ФормаВыбораВстроеннойОбработки",,ЭтаФорма,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыборВстроеннойОбработки(Результат, Дополнительныепараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ИмяВстроеннойОбработки 	= Результат.Имя;
	Объект.ПредставлениеОбработки 	= Результат.Представление;
	Объект.ТипВнешнегоОбъекта 		= Результат.ТипВнешнегоОбъекта;
	
	Результат = ПолучитьСтруктуруОписанияДляВстроеннойОбработки();
	
	Если Результат.Код <> 0 Тогда
		ПоказатьПредупреждение(, Результат.ОписаниеОшибки,,"Ошибка загрузки внешней обработки");
		Возврат;
	КонецЕсли;
	
	ОбработатьЗагрузкуОбъекта(Результат);
	
	УстановитьПредупреждеиеНесоответствииВерсии();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтладкаИмяОбработкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет") Тогда
		Фильтр = "Внешние отчеты (*.erf)|*.erf";
	Иначе
		Фильтр = "Внешние обработки (*.epf)|*.epf";
	КонецЕсли;
	
	ДиалогОткрытияФайла 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла 		= "";
	ДиалогОткрытияФайла.Фильтр 				= Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор 	= Ложь;
	ДиалогОткрытияФайла.Заголовок 			= "Выберите внешний файл";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьЗагрузкуФайлаОтладки",ЭтотОбъект); 
	
	НачатьПомещениеФайла(ОписаниеОповещения, , ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗагрузкуФайлаОтладки(Результат, Адрес, ПолноеИмя, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	Файл = новый Файл(ПолноеИмя);
	
	Если Файл.Существует() Тогда
		Объект.ОтладкаИмяОбработки = Файл.ПолноеИмя;
		Объект.ИмяВнешнегоОбъекта  = ПолучитьИмяВнешнейОбработки();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьИмяВнешнейОбработки()
	
	ИмяВнешнегоОбъекта ="";
	
	Если Объект.ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет") Тогда
		Менеджер = ВнешниеОтчеты;
	Иначе
		Менеджер = ВнешниеОбработки;
	КонецЕсли;
	
	Попытка
		стрВнешнийОбъект = СокрЛП(Менеджер.Создать(Объект.ОтладкаИмяОбработки));
	Исключение
	КонецПопытки;
	
	мДанныеОбъекта = СтрРазделить(стрВнешнийОбъект,".",Ложь);
	Если мДанныеОбъекта.Количество() > 0 Тогда
		ИмяВнешнегоОбъекта = мДанныеОбъекта[1];
	КонецЕсли;
	
	Возврат	ИмяВнешнегоОбъекта;
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ОбработатьЗагрузкуОбъекта(Результат,ИмяЗагружаемогоФайла=Неопределено)
	// --- 
	
	СтруктураОписания = ПолучитьИзВременногоХранилища(Результат.СтруктураОписания);
	// --- 
	
	Если ИмяЗагружаемогоФайла <> Неопределено Тогда
		
		Объект.ИмяФайла = ИмяЗагружаемогоФайла;
		
	КонецЕсли; 
	
	_ПО.ЗаполнитьИнформациюПоОбработке(Объект,СтруктураОписания);
	
	ОбработкаЗагружена = Истина;
	Модифицированность = Истина;
	
	Если СтруктураОписания.Вид = "ВнешняяКоманда" Тогда
		ОбновитьВнешниеКомандыВРегистре = истина;
	КонецЕсли;

	Объект.ДатаЗаписи = ТекущаяДата();
	
	ПроверитьВстроеннуюОбработку();
	
	УстановитьПредупреждеиеНесоответствииВерсии();
	
	_УправлениеФормой();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если (НЕ Объект.Встроенная и НЕ Объект.Отладка) ИЛИ Объект.НеИспользуется Тогда
		//Ничего не выбрано, ничего проверять не нужно.
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.Встроенная И НЕ ОбработкаЗагружена и НЕ Объект.Отладка Тогда
		
		Отказ = Истина;
		_УФК.ВывестиПредупреждение("Не загружена обработка.");
		
	КонецЕсли; 
	
	Если Объект.Вид = "ВнешняяФорма" и не ИспользованиеВнешнихПодключаемыхФормОбъектов Тогда
		ПоказатьПредупреждение(,"Для загрузки внешней подкючаемой формы объекта необходимо включить исползование внешних форм.");
		Отказ = истина;
	КонецЕсли;
	
	Если Объект.Отладка и Не ЗначениеЗаполнено(Объект.ОтладкаИмяОбработки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбра файл внешней обработки",,"ОтладкаИмяОбработки","Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоследний(Команда)
	
	Объект.Индекс = ПолучитьПоследний();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПоследний()
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(CW_ПодключаемыеОбъектыРасположениеОбъекта.Ссылка.Индекс) КАК Индекс
	|ИЗ
	|	Справочник.CW_ПодключаемыеОбъекты.РасположениеОбъекта КАК CW_ПодключаемыеОбъектыРасположениеОбъекта
	|ГДЕ
	|	НЕ CW_ПодключаемыеОбъектыРасположениеОбъекта.Ссылка.ПометкаУдаления
	|	И CW_ПодключаемыеОбъектыРасположениеОбъекта.Ссылка.РасполагатьНаРабочемСтоле
	|	И НЕ CW_ПодключаемыеОбъектыРасположениеОбъекта.Ссылка.НеИспользуется
	|	И CW_ПодключаемыеОбъектыРасположениеОбъекта.Расположение В(&мРасположение)";
	
	Запрос.УстановитьПараметр("мРасположение", Объект.РасположениеОбъекта.Выгрузить().ВыгрузитьКолонку("Расположение"));
	
	РезультатЗапроса = запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(ЗначениеЗаполнено(Выборка.Индекс),Выборка.Индекс + 1,0);
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьДанныеРабочегоСтола");
	
КонецПроцедуры


&НаСервере
Функция _ОбработатьЗагрузкуФайла(Адрес)
	// --- 
	
	Попытка
		ДД = ПолучитьИзВременногоХранилища(Адрес);
		АдресКартинки = ПоместитьВоВременноеХранилище(ДД,ЭтаФорма.УникальныйИдентификатор);
		
		Возврат(_УФКС.Ответ());
	Исключение
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	// --- 
КонецФункции

&НаКлиенте
Процедура НастройкиВнешнегоОтчета(Команда)
	
	АдресНастроек 		= Новый Структура("АдресНастроек", ПолучитьАдресНастроекФормы());
	ОписаниеОповещения = новый ОписаниеОповещения("ПриЗакрытиФормыНастроекВнешнегоОтчета", ЭтаФорма);
	
	ОткрытьФорму("Справочник.CW_ПодключаемыеОбъекты.Форма.ФормаНастроекВнешнегоОтчета",АдресНастроек, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры


&НаСервере
Функция ПолучитьАдресНастроекФормы()
	
	КомандаОтчета = Новый Структура("ИмяКартинки,ИмяКоманды,ПредставлениеКоманды","","","");
	
	Отбор = новый Структура;
	Отбор.Вставить("ОсновнаяКоманда", Истина);
	мКоманда = Объект.КомандыОбъекта.НайтиСтроки(Отбор);
	
	
	Если мКоманда.Количество() <> 0 Тогда
		//Основаня команда не указана!!!
		ЗаполнитьЗначенияСвойств(КомандаОтчета, мКоманда[0]);
		
	Иначе
		
		Если  Объект.КомандыОбъекта.Количество() > 0 Тогда
			//Берем первую!
			ЗаполнитьЗначенияСвойств(КомандаОтчета,  Объект.КомандыОбъекта[0]);
		КонецЕсли;
		
	КонецЕсли;
	
	СписокКомандОбъекта = новый СписокЗначений;
	Для Каждого СтрокаКоманд из Объект.КомандыОбъекта Цикл
		СписокКомандОбъекта.Добавить(СтрокаКоманд.ИмяКоманды, СтрокаКоманд.ПредставлениеКоманды);
	КонецЦикла;

	
	Настройки = Новый Структура;
	Настройки.Вставить("Индекс"					, Объект.Индекс);
	Настройки.Вставить("КомандаОтчета"			, КомандаОтчета);
	Настройки.Вставить("РасположениеОбъекта"	, Объект.РасположениеОбъекта.Выгрузить().ВыгрузитьКолонку("Расположение"));
	Настройки.Вставить("ДоступностьОбъекта" 	, Объект.ДоступностьОбъекта.Выгрузить().ВыгрузитьКолонку("ГруппаПользователей"));
	Настройки.Вставить("СписокКомандОбъекта"    , СписокКомандОбъекта);
	Настройки.Вставить("КомандыОбъекта"     	, Объект.КомандыОбъекта.Выгрузить());
	Настройки.Вставить("ЭтоОтчет"     			, ПолучитьТипОбъекта());
	
	Возврат ПоместитьВоВременноеХранилище(Настройки);
	
КонецФункции

&НаСервере
Функция ПолучитьТипОбъекта()
	
	Если Объект.Отладка Тогда
		//Из конфигурации
		Попытка
			ПодключенныйОтчет =	Отчеты[Объект.ИмяВстроеннойОбработки];
			Возврат истина;
		Исключение
		КонецПопытки;
	Иначе
		Если СтрНайти(Объект.ИмяФайла, "erf") > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытиФормыНастроекВнешнегоОтчета(Результат, ДопПараметр) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработатьРезультаНастроек(Результат);
		Модифицированность = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультаНастроек(Результат)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		Настройки = ПолучитьИзВременногоХранилища(Результат);
		
		КомандаОтчета = Настройки.КомандаОтчета;
		
		Для Каждого СтрокаКоманд из Объект.КомандыОбъекта Цикл
			СтрокаКоманд.ОсновнаяКоманда = ЛожЬ;
		КонецЦикла;
		
		Отбор = Новый Структура("ИмяКоманды",КомандаОтчета.ИмяКоманды);
		мКоманда = Объект.КомандыОбъекта.НайтиСтроки(Отбор);
		
		Если мКоманда.Количество() <> 0 Тогда
			мКоманда[0].ИмяКартинки 			= КомандаОтчета.ИмяКартинки;
			мКоманда[0].ПредставлениеКоманды 	= КомандаОтчета.ПредставлениеКоманды;
			мКоманда[0].ОсновнаяКоманда 		= истина;
		КонецЕсли;
		
		Объект.РасположениеОбъекта.Очистить();
		Объект.ДоступностьОбъекта.Очистить();
		
		Для Каждого СтрокаМассива из Настройки.ДоступностьОбъекта  Цикл
			  НоваяСтрока = Объект.ДоступностьОбъекта.Добавить();
			  НоваяСтрока.ГруппаПользователей = СтрокаМассива;		
		КонецЦикла;
		
		Для Каждого СтрокаМассива из Настройки.РасположениеОбъекта  Цикл
			  НоваяСтрока = Объект.РасположениеОбъекта.Добавить();
			  НоваяСтрока.Расположение = СтрокаМассива;		
		  КонецЦикла;
		  
		Объект.Индекс = Настройки.Индекс;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиВнешнейПодписки(Команда)
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		
		ПоказатьПредупреждение(,"Данные еще не записаны. Переход к форме внешней подписки возможен только после записи данных!");
		
	Иначе
		
		ОбработатьОткрытиеФормыВнешнейПодписки()
		
	КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура НастройкиВнешнейФормы(Команда)
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Данные еще не записаны. Переход к подключаемой форме возможен только после записи данных!");
	Иначе
		ОбработатьОткрытиеПодключаемойФормы()
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОткрытиеПодключаемойФормы()
	
	СсылкуНаПодключаемуюФорму = ПолучитьСсылкуНаПодключаемуюФорму();
	
	Если ЗначениеЗаполнено(СсылкуНаПодключаемуюФорму) Тогда
		ПоказатьЗначение(,СсылкуНаПодключаемуюФорму);
	Иначе
		
		ИдентификаторОбъектаМетаданных = ПолучитьИдентификаторОбъектаМетаданных();
		
		Если ИдентификаторОбъектаМетаданных <> Неопределено Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура ("ИдентификаторОбъектаМетаданных, ПодключаемыйОбъект", ИдентификаторОбъектаМетаданных, Объект.Ссылка));
			ПараметрыФормы.Вставить("Наименование"		, Объект.Наименование);
			
			ОткрытьФорму("Справочник.CW_ПодключаемыеФормы.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, Истина);
		Иначе
			ПоказатьПредупреждение(,"Не удалось получить Идентификатор объекта метаданных");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИдентификаторОбъектаМетаданных()
	
	ИмяМетаданного =  Справочники.CW_ПодключаемыеФормы.ПолучитьИмяМетаданногоПодключаемойФормы(Объект.Ссылка);
	
	Если ИмяМетаданного <> Неопределено Тогда
		Возврат ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ИмяМетаданного);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкуНаПодключаемуюФорму()
	
	Возврат Справочники.CW_ПодключаемыеФормы.НайтиПоРеквизиту("ПодключаемыйОбъект", Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьОткрытиеФормыВнешнейПодписки()
	
	ДанныеПодписки = ПолучитьИнформациюВнешнейподписки();

	МетаданныеПодпискиКоличество = ДанныеПодписки.МетаданныеПодписки.Количество();
	
	мСвязанныеПодписки = ПолучитьСвязанныеВнешниеПодписки();
	
	Если мСвязанныеПодписки <> Неопределено Тогда
		
		Если мСвязанныеПодписки.Количество() > 0 Тогда
			
			Если МетаданныеПодпискиКоличество = 1 и мСвязанныеПодписки.Количество() = 1 Тогда
				
				ПоказатьЗначение(,мСвязанныеПодписки[0]);
				
			Иначе
				АдресСпискаЗначений = ПолучитьАдресСписакаСвязанныхПодписок(мСвязанныеПодписки, МетаданныеПодпискиКоличество);
				
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("АдресСпискаЗначений"	, АдресСпискаЗначений);
				ПараметрыФормы.Вставить("СписокСПометками"		, Ложь);
				ПараметрыФормы.Вставить("ЗаголовокФормы"		, "Список связанных подписок");
				
				ОписаниеОповещения = новый ОписаниеОповещения("ПриЗакрытиФормыВыбораИзСписка", ЭтотОбъект);
				ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораИзСписка", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ОткрытьФормуНовойВнешнейПодписки();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИнформациюВнешнейподписки()
	
	Возврат Справочники.CW_ВнешниеПодписки.ПолучитьДанныеВнешнейПдписки(Объект.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуНовойВнешнейПодписки()
	
	ДанныеПодписки = ПолучитьИнформациюВнешнейподписки();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура ("ВидПодписки, Обработка", ДанныеПодписки.ВидПодписки, Объект.Ссылка));
	ПараметрыФормы.Вставить("Наименование"		, Объект.Наименование);
	
	ОткрытьФорму("Справочник.CW_ВнешниеПодписки.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма, Истина);
	
КонецПроцедуры

&наСервере
Функция ПолучитьАдресСписакаСвязанныхПодписок(мСвязанныеПодписки, ДоступноеКоличество)
	
	СписокПодписок = Новый СписокЗначений;
	СписокПодписок.ЗагрузитьЗначения(мСвязанныеПодписки);
	
	Если СписокПодписок.Количество() < ДоступноеКоличество Тогда
		СписокПодписок.Добавить("Создать", "<Создать новую>");
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(СписокПодписок);
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытиФормыВыбораИзСписка(Результат, ДопПараметр) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗначениеВыбора = ОбработатьРезультаВыбораЗначения(Результат);
		
		Если  ЗначениеЗаполнено(ЗначениеВыбора) Тогда
			
			Если ЗначениеВыбора = "Создать" Тогда
				//Создаем новую подписку на событие
				ОткрытьФормуНовойВнешнейПодписки();
				
			Иначе
				
				//Открываем выбранное значение
				ПоказатьЗначение(,ЗначениеВыбора);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьРезультаВыбораЗначения(Результат)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		СтркутураОтвета = ПолучитьИзВременногоХранилища(Результат);
		Возврат СтркутураОтвета.Значение;
	КонецЕсли;
	
	Возврат Неопределено
	
КонецФункции

&НаСервере
Функция ПолучитьСвязанныеВнешниеПодписки()
	
	Возврат Справочники.CW_ПодключаемыеОбъекты.ПолучитьСвязанныеВнешниеПодписки(Объект.Ссылка); 
	
КонецФункции


&НаКлиенте
Процедура НастройкаВнешнейКоманды(Команда)
	
	АдресНастроек 		= Новый Структура("АдресНастроек", ПолучитьАдресНастроекВнешнейКоманды());
	ОписаниеОповещения = новый ОписаниеОповещения("ПриЗакрытиФормыНастроекВнешнейКоманды", ЭтаФорма);
	
	ОткрытьФорму("Справочник.CW_ПодключаемыеОбъекты.Форма.ФормаНастроекВнешнейКоманды",АдресНастроек, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытиФормыНастроекВнешнейКоманды(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ОбработатьРезультатНастройкиВнешнейКоманды(Результат);
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Процедура ОбработатьРезультатНастройкиВнешнейКоманды(Результат)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		Объект.ПараметрыВнешнейКоманды.Очистить();
		ТаблицаПараметров = ПолучитьИзВременногоХранилища(Результат);
		
		Для Каждого СтрокаТаблицыПараметров из ТаблицаПараметров Цикл
			НоваяСтрока = Объект.ПараметрыВнешнейКоманды.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыПараметров);
			
			НоваяСтрока.АдресГруппДоступа = ПоместитьВоВременноеХранилище(СтрокаТаблицыПараметров.ГруппыДоступа.ВыгрузитьЗначения(),ЭтаФорма);
			
		КонецЦикла;
		
		Модифицированность 				= Истина;
		ОбновитьВнешниеКомандыВРегистре = Истина;
		
	КонеЦЕсли;
	
КонецПроцедуры
	

&НаСервере
Функция  ПолучитьАдресНастроекВнешнейКоманды()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ПараметрыВнешнейКоманды.Выгрузить());
	
КонецФункции


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОбновитьВнешниеКомандыВРегистре Тогда
		Справочники.CW_ПодключаемыеОбъекты.ЗарегистрироватьВнешниеКоманды(Объект.Ссылка);
		ОбновитьВнешниеКомандыВРегистре = Ложь;
	КонецЕсли;
	
	Если ИзмененоИспользованиеОбработки Тогда
		
		Если ТекущийОбъект.НеИспользуется Тогда
			ОбработатьИспользованиеВнешнихПодписок();
			ОбработатьИспользованиеПодключаемыхФорм();
		КонецЕсли;
		
		ИзмененоИспользованиеОбработки = ложь;
		
	КонецЕсли;
	
	ОбновитьАдресаГруппДоступа();
	
КонецПроцедуры

&наСервере
Функция ПолучитьСоответствиеТипаОбработкиРодителю()
	
	Результат = Новый Соответствие;
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет"), 		ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОтчеты"));
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка"), 	ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОбработки"));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбработатьИспользованиеВнешнихПодписок()
	
	мВнешниеПодписки =	ПолучитьСвязанныеВнешниеПодписки();

	Если мВнешниеПодписки <> Неопределено Тогда
		Для Каждого Подписка из мВнешниеПодписки Цикл
			
			ПодпискаОбъект = Подписка.ПолучитьОбъект();
			ПодпискаОбъект.НеИспользуется = Истина;
			ПодпискаОбъект.Записать();
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&наСервере
Процедура ОбработатьИспользованиеПодключаемыхФорм()
	
	ПодключаемаяФорма = ПолучитьСсылкуНаПодключаемуюФорму();

	Если ЗначениеЗаполнено(ПодключаемаяФорма) Тогда
		ПодключаемаяФормаОбъект 				= ПодключаемаяФорма.ПолучитьОбъект();
		ПодключаемаяФормаОбъект.НеИспользуется 	= Истина;
		ПодключаемаяФормаОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры
	

&НаКлиенте
Процедура НеИспользуетсяПриИзменении(Элемент)
	
	Если Объект.Вид = "ВнешняяКоманда" Тогда
		ОбновитьВнешниеКомандыВРегистре = Истина;
	КонецЕсли;
	
	ИзмененоИспользованиеОбработки = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяВстроеннойОбработкиПриИзменении(Элемент)
	
	ПроверитьВстроеннуюОбработку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьИнформациюОВнешнейОбработке(Команда)
	
	Результат = ПолучитьСтруктуруОписанияДляВстроеннойОбработки(Ложь);
	Если Результат.Код <> 0 Тогда
		ПоказатьПредупреждение(,Результат.ОписаниеОшибки,,"Ошибка загрузки внешней обработки");
		Возврат;
	Иначе
		ОбработатьЗагрузкуОбъекта(Результат);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВстроеннуюОбработку()
	
	Попытка
		Если Объект.ТипВнешнегоОбъекта = Перечисления.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет Тогда
			Менеджер = Отчеты[Объект.ИмяВстроеннойОбработки];
		Иначе
			Менеджер = Обработки[Объект.ИмяВстроеннойОбработки];
		КонецЕсли;                  
		Элементы.ИмяВстроеннойОбработки.ЦветТекстаЗаголовка	= Новый Цвет();
	Исключение
		Элементы.ИмяВстроеннойОбработки.ЦветТекстаЗаголовка	= Новый Цвет(255,0,0);
		Элементы.СтраницыОбъекта.ТекущаяСтраница 			= Элементы.Страница_ОписаниеОбъекта;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПредставленияПечатнойФормыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// при нажатии выбора не обновлялся текст
	Объект.ШаблонПредставленияПечатнойФормы = ЭтаФорма.Элементы.ШаблонПредставленияПечатнойФормы.ТекстРедактирования;
	
	Если Объект.Макросы.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Для печатной формы не определены макросы формирования представления!");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПодключаемыйОбъект", Объект.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборМакроса", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_ПодключаемыеОбъекты.Форма.ФормаВыбраМакросов", СтруктураПараметров, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборМакроса(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ШаблонПредставленияПечатнойФормы = Объект.ШаблонПредставленияПечатнойФормы + РезультатВыбора;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияИзменений(Команда)
	
	МакетИсторияИзменений = ПорлучитьИсториюИзмененийНаСервере();
	Если МакетИсторияИзменений <> Неопределено Тогда
		
		МакетИсторияИзменений.ОтображатьГруппировки = Истина;
		МакетИсторияИзменений.ОтображатьЗаголовки 	= Ложь;
		МакетИсторияИзменений.ОтображатьСетку 		= Ложь;
		МакетИсторияИзменений.ТолькоПросмотр 		= Истина;
		
		МакетИсторияИзменений.Показать("История изменений внешнего объекта");
		
	Иначе
		ПоказатьПредупреждение(,"Не удалось получить историю изменений внешнего объекта", 30);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПорлучитьИсториюИзмененийНаСервере()
	
	Попытка
		
		Если Объект.Встроенная Тогда
			Если Объект.ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет") Тогда
				ВнешняяОбработка = Отчеты[Объект.ИмяВстроеннойОбработки].Создать();
			Иначе
				ВнешняяОбработка = Обработки[Объект.ИмяВстроеннойОбработки].Создать();
			КонецЕсли;                  
		Иначе   
			
			Если ЭтоАдресВременногоХранилища(АдресОбработки) Тогда
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресОбработки);
			КонецЕсли;  
			
			Если ДвоичныеДанные = Неопределено Тогда
				ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
				ДвоичныеДанные	= ОбработкаОбъект.ХранилищеОбработки.Получить();
			КонецЕсли;  
			
			Если ДвоичныеДанные = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
			
			ИмяФайлаОбработки 	= КаталогВременныхФайлов()+ Объект.ИмяФайла;
			ДвоичныеДанные.Записать(ИмяФайлаОбработки);
			
			Файл = Новый Файл(ИмяФайлаОбработки);
			Если Не Файл.Существует() Тогда
				Возврат Неопределено;
			КонецЕсли;
			
			Если Файл.Расширение = ".erf" Тогда
				ВнешняяОбработка = ВнешниеОтчеты.Создать(ИмяФайлаОбработки);
			ИначеЕсли Файл.Расширение = ".epf" Тогда
				ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайлаОбработки);
			Иначе
				Возврат Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка
			Возврат ВнешняяОбработка.ПолучитьМакетИсторииИзменений();
		Исключение
			Возврат Неопределено;
		КонецПопытки; 
		
	Исключение
		Возврат Неопределено;
	КонецПопытки; 
	
КонецФункции



#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
